In [2]:
import pandas as pd
from matplotlib import pyplot as plt
import numpy as np
import os
os.chdir('E:\project')
os.getcwd()

'E:\\project'

In [3]:
df=pd.read_csv("father_son.csv")
df

      Father   Son
0       65.0  59.8
1       63.3  63.2
2       65.0  63.3
3       65.8  62.8
4       61.1  64.3
...      ...   ...
1073    67.0  70.8
1074    71.3  68.3
1075    71.8  69.3
1076    70.7  69.3
1077    70.3  67.0

[1078 rows x 2 columns]

In [4]:
df.shape

(1078, 2)

In [5]:
df.dtypes

Father    float64
Son       float64
dtype: object

In [6]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1078 entries, 0 to 1077
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Father  1078 non-null   float64
 1   Son     1078 non-null   float64
dtypes: float64(2)
memory usage: 17.0 KB
None

In [7]:
df.describe()

            Father          Son
count  1078.000000  1078.000000
mean     67.686827    68.684230
std       2.745827     2.816194
min      59.000000    58.500000
25%      65.800000    66.900000
50%      67.800000    68.600000
75%      69.600000    70.500000
max      75.400000    78.400000

In [8]:
cnt=df.isnull().sum()
print(" Data columns with null values ",cnt)

 Data columns with null values  Father    0
Son       0
dtype: int64

In [9]:
#TO GET THE NUMERICAL VARIABLES
numerical_features=(df.select_dtypes(include=['int64','float64']).columns.values)
numerical_features

array(['Father', 'Son'], dtype=object)

In [10]:
#TO GET THE categorical VARIABLES
categorical_features=(df.select_dtypes(include=['object']).columns.values)
categorical_features

array([], dtype=object)

In [11]:
df.head()

   Father   Son
0    65.0  59.8
1    63.3  63.2
2    65.0  63.3
3    65.8  62.8
4    61.1  64.3

In [12]:
df.tail()

      Father   Son
1073    67.0  70.8
1074    71.3  68.3
1075    71.8  69.3
1076    70.7  69.3
1077    70.3  67.0

In [13]:
from sklearn.model_selection import train_test_split

In [14]:
X = df.drop("Son", axis=1)
y = df['Son']

In [15]:
X

      Father
0       65.0
1       63.3
2       65.0
3       65.8
4       61.1
...      ...
1073    67.0
1074    71.3
1075    71.8
1076    70.7
1077    70.3

[1078 rows x 1 columns]

In [16]:
y

0       59.8
1       63.2
2       63.3
3       62.8
4       64.3
        ...
1073    70.8
1074    68.3
1075    69.3
1076    69.3
1077    67.0
Name: Son, Length: 1078, dtype: float64

In [17]:
X_train, X_test, y_train, y_test = train_test_split(X, y,test_size=0.2, random_state=0)

In [18]:
X_train

      Father
988     68.8
485     66.0
54      65.6
34      68.3
366     70.5
...      ...
1033    69.6
763     67.9
835     72.8
559     70.2
684     69.7

[862 rows x 1 columns]

In [19]:
X_test

      Father
239     63.9
1016    70.6
725     66.1
486     66.0
561     71.1
...      ...
474     64.7
632     68.8
658     63.0
533     72.4
483     66.1

[216 rows x 1 columns]

In [20]:
X_test

      Father
239     63.9
1016    70.6
725     66.1
486     66.0
561     71.1
...      ...
474     64.7
632     68.8
658     63.0
533     72.4
483     66.1

[216 rows x 1 columns]

In [21]:
y_train

988     68.9
485     66.8
54      67.6
34      66.3
366     70.3
        ...
1033    71.6
763     69.1
835     72.4
559     69.4
684     66.6
Name: Son, Length: 862, dtype: float64

In [22]:
y_test

239     66.7
1016    70.4
725     68.1
486     67.1
561     69.5
        ...
474     66.8
632     75.7
658     65.2
533     68.6
483     67.2
Name: Son, Length: 216, dtype: float64

In [23]:
from sklearn.linear_model import LinearRegression

In [24]:
my_model = LinearRegression() #my_model is created using the linear regression algorithm
result = my_model.fit(X_train, y_train) #train the my_model using the X_train, y_train data
res=my_model.score(X_train, y_train)
print("The Training Score of Linear Regression Model is",res*100)

The Training Score of Linear Regression Model is 25.089366998728657

In [25]:
predictions = result.predict(X_test) ## the trained model is tested using X_test
predictions

array([66.79242428, 70.20655392, 67.91348177, 67.86252462, 70.46133972,
       68.21922473, 69.74793949, 67.14912439, 68.93262495, 71.12378278,
       69.84985381, 68.16826757, 68.42305336, 67.70965314, 71.07282562,
       68.67783916, 69.95176813, 70.25751108, 68.42305336, 66.33380985,
       70.00272529, 68.52496768, 68.3720962 , 67.09816723, 68.21922473,
       65.26370951, 69.28932506, 68.98358211, 67.86252462, 67.60773882,
       71.17473994, 68.21922473, 68.52496768, 68.52496768, 69.39123938,
       69.08549643, 70.81803983, 67.5058245 , 71.53144005, 68.626882  ,
       69.13645359, 69.28932506, 68.57592484, 66.28285269, 67.91348177,
       66.84338144, 67.86252462, 69.13645359, 70.91995415, 66.43572417,
       69.59506802, 67.91348177, 69.54411086, 69.08549643, 68.57592484,
       66.48668133, 67.04721007, 67.96443893, 67.96443893, 67.91348177,
       68.77975347, 67.20008155, 66.74146712, 69.13645359, 66.38476701,
       67.86252462, 69.79889665, 69.74793949, 69.44219654, 70.66516835,
       70.00272529, 65.31466667, 69.08549643, 69.95176813, 67.09816723,
       67.91348177, 70.15559676, 69.44219654, 67.96443893, 68.21922473,
       67.45486734, 67.7606103 , 67.40391019, 67.09816723, 69.84985381,
       67.14912439, 69.90081097, 71.12378278, 68.42305336, 68.57592484,
       70.61421119, 67.55678166, 67.14912439, 67.91348177, 67.70965314,
       68.77975347, 66.69050996, 68.88166779, 69.59506802, 72.29579743,
       69.54411086, 70.76708267, 69.2383679 , 71.88814016, 70.91995415,
       68.11731041, 67.81156746, 68.32113904, 69.34028222, 71.58239721,
       68.67783916, 68.67783916, 69.03453927, 68.57592484, 67.14912439,
       67.60773882, 67.20008155, 66.79242428, 69.59506802, 69.03453927,
       69.90081097, 68.72879632, 69.59506802, 67.86252462, 69.08549643,
       67.70965314, 67.81156746, 69.90081097, 69.34028222, 68.42305336,
       65.36562383, 70.25751108, 70.15559676, 66.8943386 , 69.28932506,
       68.626882  , 68.27018189, 68.83071063, 69.74793949, 70.20655392,
       66.33380985, 66.48668133, 66.18093837, 67.35295303, 70.51229687,
       68.32113904, 71.2256971 , 69.90081097, 68.88166779, 70.66516835,
       66.99625291, 67.91348177, 68.06635325, 67.35295303, 70.00272529,
       67.25103871, 67.96443893, 66.18093837, 69.95176813, 71.37856858,
       69.54411086, 67.5058245 , 64.55030929, 70.05368245, 68.52496768,
       69.2383679 , 67.65869598, 68.93262495, 67.91348177, 68.57592484,
       69.54411086, 68.16826757, 68.93262495, 68.67783916, 69.03453927,
       68.67783916, 68.72879632, 68.06635325, 68.52496768, 68.72879632,
       68.16826757, 68.77975347, 69.44219654, 69.90081097, 68.47401052,
       68.52496768, 69.13645359, 68.52496768, 68.11731041, 69.74793949,
       66.69050996, 68.52496768, 67.40391019, 68.52496768, 68.01539609,
       67.96443893, 66.48668133, 68.83071063, 69.39123938, 68.21922473,
       68.11731041, 66.28285269, 67.96443893, 69.44219654, 67.91348177,
       71.32761142, 71.27665426, 70.51229687, 68.57592484, 68.21922473,
       69.44219654, 67.20008155, 69.28932506, 66.33380985, 71.12378278,
       67.91348177])

In [26]:
import pickle
pickle.dump(my_model, open('model.pkl','wb'))